Repository: 3bdulra7manAmir/Portfolio_v2
Catalog: lib/config/i18n/l10n/intl_*.arb
Languages: ar

source: Error
ar: خطأ

source: Home
ar: الرئيسيـة

source: Services
ar: خدماتي

source: About Me
ar: عني

# myProjects
source: Projects
ar: مشاريعي

source: Resume
ar: السيرة الذاتية

source: Dark
ar: داكن

source: Light
ar: فاتح

source: Logo
ar: الشعار

source: Hire me
ar: وظفني

source: Contact Me
ar: تواصل معي

# hi
source: Hi, I am
ar: اهلا, انا

# AbdoAmir
source: Abdulrahman Amir
ar: عبدالرحمن امير

# role
source: Flutter Developer
ar: مطور فلاتر

source: Download CV
ar: تحميل السيرة الذاتية

source: Experience
ar: خبرة

source: Projects
ar: مشاريع

source: Happy Clients
ar: عملاء سعيدون

# mobileAppDevelopmentTitle
source: Mobile App Development (iOS & Android)
ar: تطوير تطبيقات الموبايل (iOS و Android)

# mobileAppDevelopmentDesc
source: I develop high-quality mobile applications for both iOS and Android using Flutter. My focus is on delivering fast, responsive, and user-friendly apps that feel native on each platform. I ensure smooth navigation, intuitive design, and seamless performance across different devices.
ar: أقوم بتطوير تطبيقات موبايل عالية الجودة لكلٍ من iOS و Android باستخدام Flutter. أركز على تقديم تطبيقات سريعة الاستجابة وسهلة الاستخدام تشبه التطبيقات الأصلية على كل منصة. أضمن تنقلًا سلسًا، وتصميمًا بديهيًا، وأداءً ممتازًا عبر مختلف الأجهزة.

# crossPlatformDevelopmentTitle
source: Cross-platform Development
ar: التطوير متعدد المنصات

# crossPlatformDevelopmentDesc
source: I build applications that run seamlessly across multiple platforms using a single Flutter codebase. This approach saves time, reduces costs, and ensures consistent performance and design. Whether it’s Android, iOS, web, or desktop, I make sure the app adapts smoothly.
ar: أبني تطبيقات تعمل بسلاسة على منصات متعددة باستخدام كود Flutter واحد. هذا الأسلوب يوفر الوقت ويقلل التكاليف ويضمن أداءً وتصميمًا متناسقًا. سواء كان التطبيق يعمل على Android أو iOS أو الويب أو سطح المكتب، أحرص على أن يتكيف بسلاسة.

# uiUxImplementationTitle
source: UI/UX Implementation
ar: تنفيذ واجهات وتجربة المستخدم (UI/UX)

# uiUxImplementationDesc
source: I transform design prototypes from tools like Figma into functional and pixel-perfect Flutter interfaces. My work emphasizes responsive layouts, clear typography, and engaging animations. The result is a user experience that’s both visually appealing and easy to use.
ar: أحوّل النماذج التصميمية من أدوات مثل Figma إلى واجهات Flutter عملية ومتقنة. أركز على تصميمات متجاوبة، وخطوط واضحة، ورسوم متحركة جذابة. والنتيجة هي تجربة مستخدم بصرية ممتعة وسهلة الاستخدام.

# backendIntegrationTitle
source: Backend Integration
ar: تكامل مع الخوادم (Backend Integration)

# backendIntegrationDesc
source: I connect applications to backend services and APIs to bring them to life.With experience in Firebase and REST APIs, I ensure real-time updates and secure data handling. From authentication to data storage, I make sure everything works seamlessly.
ar: أربط التطبيقات بالخدمات الخلفية وواجهات الـ APIs لإضفاء الحيوية عليها. بخبرتي مع Firebase وواجهات REST APIs أضمن تحديثات في الوقت الحقيقي ومعالجة بيانات آمنة. من تسجيل الدخول إلى تخزين البيانات، أتأكد أن كل شيء يعمل بانسيابية.

# deploymentPublishingTitle
source: Deployment & Publishing
ar: النشر والإصدار

# deploymentPublishingDesc
source: I prepare applications for deployment and guide them through publishing on Google Play and the App Store. This includes app optimization, store listing setup, and compliance with platform requirements. The goal is to make your app available to users with a smooth launch process.
ar: أقوم بإعداد التطبيقات للنشر وأرشدها خلال عملية الإطلاق على متجر Google Play ومتجر App Store. يشمل ذلك تحسين التطبيق، إعداد بيانات المتجر، والالتزام بمتطلبات المنصات. الهدف هو إتاحة تطبيقك للمستخدمين مع عملية إطلاق سلسة.

source: Who I Am
ar: من أنا

# aboutMeDescription
source: I’m a Junior Flutter Developer passionate about building high-quality, cross-platform mobile applications. I specialize in responsive UI design and have solid experience in state management using BLoC, Cubit, and Riverpod. I’m skilled in leveraging tools like ScreenUtil for responsiveness, Shimmer for skeleton loading, and efficient caching with Hive, SharedPreferences, and GetStorage. My expertise also covers Firebase services including Authentication, Google Sign-In, Realtime Database, Cloud Storage, and user registration flows. I integrate theming, localization, image pre-caching, and video handling (with Picture-in-Picture support) to create seamless user experiences. With a strong focus on clean architecture and OOP principles, I ensure scalable, maintainable, and efficient codebases. Beyond mobile development, I’m passionate about modding the Call of Duty series, exploring its mechanics and creating custom content. I also enjoy working with Python, where I focus on scripting and automation to streamline workflows and solve real-world challenges. Curious and driven, I thrive on combining creativity and technology to deliver innovative solutions.
ar: أنا مطور Flutter مبتدئ شغوف ببناء تطبيقات موبايل عالية الجودة تعمل عبر الأنظمة المختلفة. أتقن تصميم واجهات المستخدم المتجاوبة ولدي خبرة قوية في إدارة الحالة باستخدام BLoC و Cubit و Riverpod. كما أجيد استخدام ScreenUtil لجعل الواجهات متجاوبة، و Shimmer لعرض الهياكل العظمية، وإدارة التخزين المؤقت بكفاءة باستخدام Hive و SharedPreferences و GetStorage. تشمل خبرتي أيضًا خدمات Firebase مثل تسجيل الدخول والمصادقة، تسجيل الدخول عبر Google، قاعدة البيانات اللحظية، التخزين السحابي، وتدفقات تسجيل المستخدم. أدمج كذلك نظام الثيمات، دعم تعدد اللغات (Localization)، التحميل المسبق للصور، وتشغيل الفيديو مع دعم Picture-in-Picture لتقديم تجارب سلسة للمستخدم. ومع تركيزي القوي على معمارية نظيفة (Clean Architecture) ومبادئ البرمجة كائنية التوجه (OOP)، أضمن كتابة شيفرة قابلة للتوسع والصيانة بكفاءة. بعيدًا عن تطوير التطبيقات، لدي شغف بتعديل ألعاب Call of Duty واستكشاف آلياتها وصناعة محتوى مخصص. كما أنني أستمتع بالعمل بلغة Python، خصوصًا في كتابة السكربتات وأدوات الأتمتة لتبسيط المهام وحل التحديات العملية. بدافعي وفضولي القوي أحب الجمع بين تطوير Flutter واهتماماتي الأخرى في البرمجة والتعديل لدفع الإبداع والتقنية إلى الأمام.

source: Fluency
ar: فلونسي

# fluencyDescription
source: Fluency is a Saudi platform that allows users to practice the English language with professional, foreign teachers from around the world. It helps individuals develop their language skills in professional and educational fields, as well as for travel abroad where the English language is often necessary.
ar: Fluency هي منصة سعودية تتيح للمستخدمين ممارسة اللغة الإنجليزية مع معلمين أجانب محترفين من جميع أنحاء العالم. تساعد الأفراد على تطوير مهاراتهم اللغوية في المجالات المهنية والتعليمية، وكذلك عند السفر إلى الخارج حيث تكون اللغة الإنجليزية ضرورية غالبًا.

source: Al Haddaf
ar: الهداف

# haddafDescription
source: Al-Haddaf is the ultimate platform for athletes, coaches, and sports enthusiasts! Create your player or coach profile and showcase your achievements and stats. Talent Marketing: Promote your skills and connect with clubs and sports agents. Upload Videos & Photos: Share your best moments and highlight your performance. Easy Communication: Interact with sports clubs and coaches effortlessly.
ar: الهداف هو المنصة المثالية للرياضيين والمدربين وعشاق الرياضة! أنشئ ملفك كلاعب أو مدرب واستعرض إنجازاتك وإحصائياتك. تسويق المواهب: روّج لمهاراتك وتواصل مع الأندية ووكلاء الرياضة. رفع الفيديوهات والصور: شارك أفضل لحظاتك وأبرز أداءك. تواصل بسهولة: تفاعل مع الأندية والمدربين الرياضيين بكل سلاسة.

source: Sehtna
ar: صحتنا

# sehtnaDescription
source: Sehtna is a comprehensive healthcare management solution designed to streamline operations for hospitals, doctors, and patients. Whether you're managing appointments, accessing medical records, or tracking patient history, Sehtna provides a powerful and user-friendly platform tailored for modern healthcare needs.
ar: صحتنا هو حل متكامل لإدارة الرعاية الصحية مصمم لتبسيط العمليات للمستشفيات والأطباء والمرضى. سواء كنت تدير المواعيد، أو تصل إلى السجلات الطبية، أو تتابع تاريخ المريض، فإن صحتنا يوفر منصة قوية وسهلة الاستخدام مصممة لتلبية احتياجات الرعاية الصحية الحديثة.

source: Added Power
ar: ادد باور

# addedPowerDescription
source: Added Power is your trusted solution for buying genuine and high-quality car spare parts directly from verified suppliers. Whether you’re a car owner or a repair specialist, our app gives you fast, secure access to the parts you need right at your fingertips.
ar: أدِد باور هو حلك الموثوق لشراء قطع غيار السيارات الأصلية وعالية الجودة مباشرة من الموردين المعتمدين. سواء كنت مالك سيارة أو مختص صيانة، يوفر لك تطبيقنا وصولًا سريعًا وآمنًا إلى القطع التي تحتاجها بكل سهولة من خلال هاتفك.

source: Rukn Al Aqar
ar: ركن العقار

# ruknDescription
source: Discover a smarter way to buy, sell, and rent apartments with Rukn Al Aqar – your trusted real estate partner. Whether you're searching for your dream home, listing a property for sale, or looking to rent, our app offers a simple and fast experience tailored to your needs.
ar: اكتشف طريقة أذكى لشراء وبيع وتأجير الشقق مع ركن العقار – شريكك الموثوق في مجال العقارات. سواء كنت تبحث عن منزل أحلامك، أو تعرض عقارًا للبيع، أو تبحث عن إيجار، يوفر لك تطبيقنا تجربة سهلة وسريعة ومصممة خصيصًا لتلبية احتياجاتك.

source: Manzoma
ar: منظومة

# manzomaDescription
source: Manzoma is a smart and powerful workflow management tool designed to help individuals and teams organize tasks and collaborate effectively. It simplifies communication between team members, reduces manual work, and improves overall productivity. With Manzoma, you can track progress, assign responsibilities, and stay focused on your goals.
ar: منظومة هي أداة ذكية وقوية لإدارة سير العمل، صممت لمساعدة الأفراد والفرق على تنظيم المهام والتعاون بفاعلية. تعمل على تبسيط التواصل بين أعضاء الفريق وتقليل العمل اليدوي وزيادة الإنتاجية بشكل عام. مع منظومة يمكنك متابعة التقدم وتوزيع المسؤوليات والبقاء مركزًا على الأهداف. سواء كنت فريقًا صغيرًا أو مؤسسة كبيرة، فإن منظومة تتكيف مع احتياجات سير عملك.
